Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-1164] improved error messaging in regexp form
ja: [ZBX-1164] 正規表現フォームのエラーメッセージを改善

source: [ZBXNEXT-279] added links to parent elements for item and trigger form
ja: [ZBXNEXT-279] アイテムとトリガーの設定フォームに親要素へのリンクを追加

source: [ZBX-4265] fixed host input validation
ja: [ZBX-4265] ホストの入力のバリデーションを修正

source: The cache module is permanently enabled.
ja: キャッシュモジュールは常に有効になっています。

source: This document contains the release notes for Zabbix 1.8.2.
ja: このドキュメントはZABBIX 1.8.2のリリースノートです。

source: Zabbix GUI fully supports PHP 5.3.
ja: Zabbix GUIはPHP 5.3を完全にサポートします。

source: No upgrade of agents required, yet recommended.
ja: エージェントのアップグレードを推奨しますが、必須ではありません。

source: Thanks to Nicob
ja: Nicobに感謝

source: ZABBIX Maintenance mode can be activated to temporary disable ZABBIX front-end.
ja: ZABBIXメンテナンスモードはZABBIXフロントエンドを一時的に無効にするために利用できます。

source: [ZBX-2290] fixed screen cells moving
ja: [ZBX-2290] スクリーンのセル移動を修正

source: This release introduces major features along with numerous improvements and bug fixes.
ja: このリリースは大きな機能追加といくつかの改善、バグフィックスが含まれます。

source: [ZBX-2250] value mapping is now applied for {ITEM.LASTVALUE} macro inside triggers description
ja: [ZBX-2250] トリガー名に{ITEM.LASTVALUE}マクロを使用した場合に値のマッピングを利用するように修正

source: ZABBIX distributed monitoring has been improved for a more efficient Node synchronisation protocol.
ja: より効率的なノード間の同期プロトコルにより、ZABBIX分散モニタリングが改善されました。

source: [ZBX-4273] fixed getting permission error while creating an action
ja: [ZBX-4273] アクション作成時のパーミッション取得エラーを修正

source: [ZBX-1762] fixed errors when editing media types
ja: [ZBX-1762] メディアタイプの編集時のエラーを修正

source: [ZBX-1264] added support of simplified syntax for external checks
ja: [ZBX-1264] 外部チェック用の簡略化した文法のサポートを追加

source: Monitoring of Zabbix performance
ja: Zabbixパフォーマンスの監視

source: Zabbix is an enterprise-class open source distributed monitoring solution.
ja: Zabbixはオープンソースで配布されるエンタープライズモニタリングソリューションです。

source: Backup/restore of configuration data
ja: 設定データのバックアップ/リストア

source: added Ldap authentication
ja: LDAP認証を追加

source: What's New in 1.5.1 (beta)
ja: ZABBIX 1.5.1 (beta)の変更点

source: [ZBX-818] In configuration->items, if selected Host All, items hosts are shown in table
ja: [ZBX-818] [設定]->[アイテム]で全てのホストを選択した場合に、ホストをテーブルで表示するように修正

source: [ZBX-1567] fixed availability graph text displaying
ja: [ZBX-1567] 稼働レポートグラフのテキスト表示を修正

source: This document contains the release notes for Zabbix 1.8.1.
ja: このドキュメントはZabbix 1.8.1のリリースノートです。

source: [ZBX-1949] fixed "housekeeping" procedure for the table "housekeeper" itself, added configuration parameter "MaxHousekeeperDelete" for the server
ja: [ZBX-1949] テーブル「housekeeper」自身の「ハウスキーピング処理」手順を修正し、サーバ用の設定パラメータ「MaxHousekeeperDelete」を追加

source: [ZBX-1603] fixed button title when editing maintenance period
ja: [ZBX-1603] メンテナンス期間の編集のボタンのタイトルを修正

source: Support of PostgreSQL has been restored.
ja: PostgreSQLがサポートされます。

source: [ZBX-1420] fixed warnings in Dashboard and on script execution if Zabbix server is down
ja: [ZBX-1420] Zabbixサーバがダウンしている場合にダッシュボードとスクリプト実行中のワーニングを修正

source: Export of events to CSV
ja: イベントのCSVエクスポート

source: improved charts period & start time selection
ja: チャートの期間と開始時間の選択を改善

source: implemented sound on/off button in status of triggers screens
ja: トリガーステータス画面にサウンドon/off機能を追加

source: [ZBX-3409] fixed semaphore and shared memory access permissions
ja: [ZBX-3409] セマフォと共有メモリのアクセス権限を修正

source: [DEV-458] added marks on maps if elements trigger changed status recently
ja: [DEV-458] トリガーステータスが変更された場合にマップ上に印をつける機能を追加

source: [ZBX-2700] updated Czech translation; thanks to Jakub Kalas
ja: [ZBX-2700] チェコ語翻訳を更新; Jakub Kalasに感謝

source: [DEV-272] added support of {HOSTNAME}, {HOST.CONN}... macros for "IPMI IP address"
ja: [DEV-272] 「IPMI IP address」で{HOSTNAME}、{HOST.CONN}などのマクロを利用できるように修正

source: [ZBX-1573] fixed colon precedence in user right entries
ja: [ZBX-1573] ユーザ権限の項目のコロンの表示を修正

source: This document contains the release notes for ZABBIX 1.3.3.
ja: このドキュメントはZABBIX 1.3.3のリリースノートです。

source: Note that ZABBIX database and ZABBIX server and agent processes still are not ready for correct processing of UTF-8 data.
ja: ZABBIXデータベースとZABBIXサーバ、エージェントはまだUTF-8のデータを正しく処理することができません。

source: Remote commands (Agent, IPMI and SSH based) can be configured in a more flexible yet easier way.
ja: (エージェント、IPMI、SSHを利用した)リモートコマンドをより簡単かつ柔軟に設定することができます。

source: ZABBIX Proxy process
ja: ZABBIXプロキシプロセス

source: the behaviour of the agent's key "vfs.fs.size" improved to be similar to the "df" command
ja: エージェントのキー「vfs.fs.size」の動作を「df」コマンドのように改善

source: [ZBX-3532] fixed add item to trigger expression from popup menu
ja: [ZBX-3532] トリガー条件式にポップアップメニューからアイテムを追加する処理を修正

source: ZABBIX 1.4 Manual
ja: ZABBIX 1.4マニュアル

source: [ZBX-876] removed unused files
ja: [ZBX-876] 利用されていないファイルを削除

source: [ZBX-1209] fixed new node not shown in the list after adding
ja: [ZBX-1209] ノード追加後のリストに新規ノードが表示されない問題を修正

source: [DEV-137] add AIX initscript for agentd by Faustino Ramos
ja: [DEV-137] Faustino RamosによるAIXの起動スクリプトを追加

source: fixed processing of macro {TRIGGER.VALUE} on 32 bit systems
ja: 32ビット環境上の{TRIGGER.VALUE}マクロの処理を修正

source: Distributed monitoring
ja: 分散モニタリング

source: Support of import/export of the host template linkage information
ja: インポート/エクスポート機能がホストテンプレートのリンク情報をサポート

source: [ZBX-1357,ZBXNEXT-376,ZBXNEXT-412] update Brazilian Portuguese translation; thanks to edson
ja: [ZBX-1357,ZBXNEXT-376,ZBXNEXT-412] ポルトガル語(ブラジル)訳を更新; edsonに感謝

source: [ZBX-2169] fixed adding dependencies to triggers on mass update
ja: [ZBX-2169] 一括更新のトリガーの依存関係の追加処理を修正

source: Multiple URLs for map elements
ja: マップの要素に複数のURLを設定可能

source: [ZBX-1557] changed process_ping logic to return an error if fping doesn't give a value (or '-') for any of the hosts but outputs something
ja: [ZBX-1557] fpingが値や'-'を返却しなかった場合にエラーを返却するようprocess_pingの処理ロジックを変更

source: [ZBX-290] fixed possible server crash if host dns name is unknown
ja: [ZBX-290] ホストのDNS名が不明な場合にサーバがクラッシュする可能性がある問題を修正

source: [ZBX-2563] fixed warnings in m4/libunixodbc.m4 with newer autotools
ja: [ZBX-2563] 最新のautotoolsによるm4/libunixodbc.m4における警告を修正

source: [ZBX-675] fixed wrong result of function "nodata" after server restart
ja: [ZBX-675] サーバ再起動後に「nodata」関数の結果が誤っていた問題を修正

source: [ZBX-2639] now when do full clone template, linkage list is cleared
ja: [ZBX-2639] テンプレートの完全複製を行ったときにホストとのリンクをクリアするように修正

source: [ZBX-2293] fixed server terminating when sending "database down" alerts using scripts
ja: [ZBX-2293] スクリプトを利用した「データベース停止」警告メッセージ送信時にサーバが終了してしまう問題を修正

source: fixed login while entering any page with HTTP auth enabled
ja: HTTP認証を有効にしてページを表示している際のログインを修正

source: [ZBX-4018] fixed server crash on unsupported aggregate items
ja: [ZBX-4018] サポートされていない累計チェックによりサーバがクラッシュする問題を修正

source: Please let us know how we can improve the templates further.
ja: さらなる改善案を私たちにお知らせください。

source: [ZBX-527] fixed possible poller crash
ja: [ZBX-527] pollerがクラッシュする可能性がある問題を修正

source: This document contains the release notes for ZABBIX 1.3.2.
ja: このドキュメントはZABBIX 1.3.2のリリースノートです。

source: [ZBX-2432] fixed warning message in templates when template has linked templates
ja: [ZBX-2432] テンプレートをリンクしたテンプレートに表示される警告メッセージを修正

source: [ZBX-2376] port parameter to tcp and tcp_perf is now mandatory
ja: [ZBX-2376] tcpとtcp_perfにポートのパラメータが必須となるように修正

source: removed "Step" field for recovery messages from Event details
ja: イベント詳細のリカバリメッセージから「Step」フィールドを削除

source: We welcome all Ukrainian users!
ja: ウクライナのユーザにも利用頂けます。

source: [ZBX-3383] fixed error in audit log when filtering by Macro or Template
ja: [ZBX-3383] マクロやテンプレートでフィルタリングされている時の監査ログのエラーを修正

source: Disabling of Login Rights for a Group of users
ja: ユーザグループのログイン権限無効設定

source: Zabbix SIA is proud to announce the availability of Zabbix 1.9.3 (Fourth Alpha Release of Zabbix 2.0).
ja: Zabbix SIAはZabbix 1.9.3 (Zabbix 2.0の4番目のアルファリリース)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-3080] fixed javascript not cached by browsers
ja: [ZBX-3080] Javascriptがブラウザにキャッシュされない問題を修正

source: [ZBX-2184] added maintenance info to dashboard latest issues
ja: [ZBX-2184] ダッシュボードの「最新の障害」にメンテナンス情報を追加

source: constants for roundoff configuration
ja: 丸め誤差の設定の定数を追加

source: Automatic selection of the first element in drop-downs
ja: ドロップダウンリストの1つ目の項目が自動選択されるように修正

source: [ZBX-3169] updated French translation; thanks to Alixen
ja: [ZBX-3169] フランス語翻訳を更新; Alixenに感謝

source: [ZBX-357] fixed problem with clearing error message for activated items
ja: [ZBX-357] アイテムを有効化した際のエラーメッセージの削除処理の問題を修正

source: [ZBX-1774] fixed error in slide screen in case if no screens defined
ja: [ZBX-1774] スクリーンが定義されていないスライドス画面のエラーを修正

source: [ZBX-1289] fixed memory leak in server pollers
ja: [ZBX-1289] サーバのpollerのメモリリークの問題を修正

source: [ZBX-192] fixed active checks stops after connection loss
ja: [ZBX-192] コネクションロス後にアクティブチェックが停止する問題を修正

source: [ZBX-4360] fixed trapper compilation error on FreeBSD 7.3
ja: [ZBX-4360] FreeBSD 7.3のトラッパーのコンパイルエラーを修正

source: Complete List of Improvements and Bug Fixes
ja: すべての改善とバグフィックスの一覧

source: It is for early beta testing only.
ja: ベータテストにのみ利用してください。

source: Zabbix Team is proud to announce the availability of Zabbix 1.8.10.
ja: Zabbix SIAはZabbix 1.8.10のリリースをアナウンスすることを光栄に思います。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.8rc3 (Third Release Candidate).
ja: Zabbix SIAはZabbix 1.8.8rc3 (3番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-1943] fixed refresh time selection in dashboard widgets
ja: [ZBX-1943] ダッシュボードウィジェットのリフレッシュ時間の選択を修正

source: [ZBX-1826] fixed error when changing node in monitoring web
ja: [ZBX-1826] Web監視でノードを変更する時に発生していたエラーを修正

source: [ZBX-1475] improved elements status checks
ja: [ZBX-1475] 要素(訳注: マップのアイコン)のステータスのチェックを改善

source: fixed "invalid URL" when use small popup menus like ping etc
ja: pingなど小さなポップアップメニュー使用時の「無効なURL」を修正

source: [ZBX-1419] don't print an informative message during upgrade if no orphan hosts were found
ja: [ZBX-1419] 孤立したホストが無い場合はアップグレード時に情報メッセージを表示しないように修正

source: [ZBX-964] added check on item in trigger expression
ja: [ZBX-964] トリガーの条件式にアイテムのチェック機能を追加

source: fixed memory leak if trigger evaluation fails
ja: トリガー評価に失敗した場合のメモリリークを修正

source: Added full-screen icon
ja: フルスクリーンアイコンの追加

source: [ZBX-3638] fixed displaying of vertical text in case of special HTML characters
ja: [ZBX-3638] 特殊なHTML文字の縦書きテキストの表示を修正

source: [ZBX-864] fixed problem when saving screen item without selected item
ja: [ZBX-864] 項目が選択されていない状態でスクリーンの項目を保存した場合の問題を修正

source: [ZBX-1148] fixed flap between available and unavailable for hosts with mixed agent and simple checks
ja: [ZBX-1148] エージェント監視とシンプルチェック監視を混在させた場合にホスト状態が監視中、未監視と切り替わる問題を修正

source: This document contains the release notes for ZABBIX 1.3.5.
ja: このドキュメントはZABBIX 1.3.5のリリースノートです。

source: Screen actions moved to Audit, added filter for Audit
ja: アクション画面を変更履歴に移動し、変更履歴画面にフィルタ機能を追加

source: This document contains the release notes for ZABBIX 1.3.4.
ja: このドキュメントはZABBIX 1.3.4のリリースノートです。

source: fixed housekeeper to run as multiple transations
ja: 多重トランザクションを実行できるようにhousekeeperを修正

source: [ZBX-1457] hosts in export file is now sorted by hostname
ja: [ZBX-1457] エクスポートファイルのホストをホスト名でソートするように修正

source: [ZBX-1983] fixed port validation in host agent port, ipmi port and in discovery checks ports (now supports for ports ranges like "21-80,465")
ja: [ZBX-1983] ホストのエージェントポート、ipmiポートとディスカバリポートチェックのチェック処理を修正 (現在"21-80,465"のようなポートの範囲指定をサポートしています)

source: [ZBX-2919] fixed custom multiplier becoming 0 when creating an item
ja: [ZBX-2919] アイテム作成時に乗数が0になる問題を修正

source: [ZBX-403] added support of commas in UserParameter's
ja: [ZBX-403] ユーザパラメータにカンマのサポートを追加

source: [DEV-468] improved theme coloring in IE
ja: [DEV-468] IE利用時のテーマの色を改善

source: List of Bug Fixes included into 1.8.8rc3
ja: 1.8.8rc3に含まれるバグフィックスの一覧

source: [DEV-310] fixed last value in charts
ja: [DEV-310] グラフ上の最終値を修正

source: List of Bug Fixes included into 1.8.8rc2
ja: 1.8.8rc2に含まれるバグフィックスと改善の一覧

source: [DEV-423] added filtering of the Windows Event Log by Type, Source and Event ID on the server side
ja: [DEV-423] サーバ側でタイプ、ソース、イベントIDによるWindowsイベントログのフィルタリングを追加

source: Zabbix SIA is proud to announce the availability of Zabbix 1.9.5 (Sixth Alpha Release of Zabbix 2.0).
ja: Zabbix SIAはZabbix 1.9.5 (Zabbix 2.0の6番目のアルファリリース)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-3766] fixed "Do" button in item form
ja: [ZBX-3766] アイテム画面の"実行"ボタンを修正

source: [DEV-445] added support of system.stat[] under AIX
ja: [DEV-445] AIXにsystem.stat[]のサポートを追加

source: [ZBX-3806] fixed HTTP pollers being started on Zabbix proxy
ja: [ZBX-3806] Zabbixプロキシ上でHTTP pollerプロセスが起動していた問題を修正

source: [ZBX-3824] fixed unnecessary synchronization of "profiles" table in DM setup
ja: [ZBX-3824] 分散監視環境で不要な"profiles"テーブルの同期を修正

source: [ZBX-3126] all checkboxes in map and screen import are now "on" by default
ja: [ZBX-3126] マップやスクリーンのインポート画面で全てのチェックボックスがデフォルトOnになるように修正

source: Please contact our sales department for pricing and more details.
ja: 価格やより詳細な情報については営業までお問い合わせください。

source: [ZBX-1294] disabled "Add" and "Toggle input method" for templated trigger expressions
ja: [ZBX-1294] テンプレートから継承されたトリガーの条件式の「追加」と「入力方式の切替」を無効化

source: [ZBXNEXT-549] added trigger function strlen()
ja: [ZBXNEXT-549] トリガー関数strlen()を追加

source: added missing index on items_applications.itemid
ja: items_applications.itemidの失われていたインデックスを追加

source: [ZBX-894] fixed processing of {ITEM.NAME},{HOSTNAME},{IPADDRESS} and {TRIGGER.KEY} for alerts if the trigger expression consists of several items
ja: [ZBX-894] トリガー条件式にいくつかのアイテムを使用した場合のアラートの{ITEM.NAME}、{HOSTNAME}、{IPADDRESS}、{TRIGGER.KEY}の処理を修正

source: This document contains the release notes for ZABBIX 1.3.6.
ja: このドキュメントはZABBIX 1.3.6のリリースノートです。

source: [DEV-404] improved web history
ja: [DEV-404] webの履歴を改善

source: It is configurable on per-user level in user profile.
ja: この設定はユーザプロファイルからユーザごとに設定を変更することができます。

source: ZABBIX agent can optionally run with super-user priviledges.
ja: ZABBIXエージェントをスーパーユーザー権限で動作させることができます。

source: [ZBX-1321] fixed displaying of large unsigned int values in latest data
ja: [ZBX-1321] 最新データに大きなunsigned intの値の表示を表示する際の問題を修正

source: [ZBX-2408] fixed mute button in status of triggers page
ja: [ZBX-2408] トリガーのステータス画面のミュートボタンの問題を修正

source: [ZBX-1229] added comparison between IPv4, IPv4-mapped and IPv4-compatible allowed server addresses
ja: [ZBX-1229] サーバアドレスとして利用できるIPv4、IPv4射影アドレス、IPv4互換アドレスの比較機能を追加

source: [ZBX-570] fixed possible server crash if flexible interval delay is 0 sec.
ja: [ZBX-570] 例外の更新間隔が0秒の場合にサーバがクラッシュすす可能性がある問題を修正

source: fixed recursion detection in Include directive for config files
ja: 設定ファイルのincludeディレクティブの再帰読込みを修正

source: [ZBX-572] fixed warning messages while updating template linkage
ja: [ZBX-572] テンプレートリンクの更新中のワーニングメッセージを修正

source: [ZBX-1476] fixed host links in map
ja: [ZBX-1476] マップにおけるホストのリンク処理を修正

source: [ZBX-3019] fixed templated graphs not being copied to discovered hosts in DM setup; thanks to Alexander Ignatyev
ja: [ZBX-3019] 分散監視環境においてディスカバリで発見されたホストにテンプレートのグラフがコピーされない問題を修正; Alexander Ignatyevに感謝

source: [ZBX-790] added protection of using special characters in user parameters of Zabbix Agent
ja: [ZBX-790] Zabbixエージェントのユーザパラメータ使用時に特殊文字の保護機能を追加

source: added availability of using spaces for trigger expressions
ja: トリガー条件式にスペースを利用できるように修正

source: [ZBX-2720] in actions conditions trigger host is now displayed
ja: [ZBX-2720] アクションのコンディション画面にトリガーのホスト名を表示

source: What's New in 1.5.x (beta)
ja: ZABBIX 1.5.x (beta)の変更点

source: [ZBX-4044] removed redundant query "SET CHARACTER SET"
ja: [ZBX-4044] 重複したクエリ「SET CHARACTER SET」を削除

source: [ZBX-1365] fixed housekeeper to process trends_uint table
ja: [ZBX-1365] trends_uintテーブルのhousekeeperの処理の問題を修正

source: fixed SQL error on login screen when postgre is used, small GUI typos fix
ja: PostgreSQLを使用している場合にログイン画面のSQLエラーの表記間違いを修正

source: This document contains the release notes for ZABBIX 1.3.7.
ja: このドキュメントはZABBIX 1.3.7のリリースノートです。

source: [ZBX-108] fixed change() and abschange() for negative integer values
ja: [ZBX-108] 負の整数を利用できるようにchange()とabschange()を修正

source: ZABBIX proxy is a lightweight process, which performs data collection on behalf of ZABBIX Server.
ja: ZABBIXプロキシはZABBIXサーバの代わりにデータ収集を行う軽量なプロセスです。

source: [ZBX-286] fixed possible server crash on some platforms
ja: [ZBX-286] 一部のプラットフォームでサーバがクラッシュする可能性がある問題を修正

source: [ZBX-2473] fixed timescroll most right position when "now"
ja: [ZBX-2473] 最右端が「現在」の時のタイムスクロールの表示の問題を修正

source: [ZBX-3877] fixed slow Housekeeper for PostgreSQL 7.4+; thanks to Ildefonso Camargo
ja: [ZBX-3877] PostgreSQL 7.4以降でハウスキーパー処理が遅い問題を修正; Ildefonso Camargoに感謝

source: [ZBX-2526] fixed graph refresh problem when referred from screens page
ja: [ZBX-2526] スクリーン画面から参照する際のグラフのリフレッシュの問題を修正

source: [ZBX-3582] fixed screen import
ja: [ZBX-3582] スクリーンのインポートを修正

source: [DEV-358] added notification macros {ITEM.LOG.*[1..9]}
ja: [DEV-358] 通知用マクロ{ITEM.LOG.*[1..9]}を追加

source: [ZBX-3295] fixed compilation warnings in eztexting module if code configured without cURL library
ja: [ZBX-3295] configure時にcURLライブラリを使用しなかった場合、コンパイル時にeztextingモジュール内で警告が出る問題を修正

source: See ZABBIX Manual for full details.
ja: 詳細はZABBIXマニュアルを参照してください。

source: [ZBX-75] fixed warning in history of events
ja: [ZBX-75] イベント履歴のワーニングを修正

source: [DEV-447,DEV-448] added support of net.if.* under Windows
ja: [DEV-447,DEV-448] Windowsの net.if.* のサポートを追加

source: ZABBIX distributed monitoring module allows to deploy ZABBIX systems easily.
ja: ZABBIXの配布モニタリングモジュールを利用することでZABBIXシステムを簡単に展開することが可能です。

source: Added support of network masks for IPv4 and IPv6 protocols.
ja: IPv4とIPv6プロトコルのネットマスクを使用することができます。

source: [ZBX-2225] fixed linkage if templated items are used in graphs as Y axis min and max values
ja: [ZBX-2225] グラフのY軸の最小値や最大値にテンプレートのアイテムが利用されている場合のリンク処理を修正

source: [ZBX-2241] fixed text collide in graphs
ja: [ZBX-2241] グラフにおけるテキスト同士の衝突を修正

source: [ZBX-996] fixed possible server crash with enabled StartDBSyncers option
ja: [ZBX-996] StartDBSyncersオプションを有効にした場合にサーバがクラッシュする可能性がある問題を修正

source: [ZBX-3025] resurrected unreachable pollers and StartPollersUnreachable configuration parameter
ja: [ZBX-3025] unreachable pollersとStartPollersUnreachable設定パラメータを復活

source: See documentation for more details.
ja: 詳細はドキュメントを参照してください。

source: [ZBX-2035] fixed host full cloning
ja: [ZBX-2035] ホストの完全複製の問題を修正

source: [ZBX-2084] fixed JSON decoding class, which didn't worked due to PCRE backtrace limit, enabled native PHP JSON functions, rewrited code with sockets
ja: [ZBX-2084] ソケットを使用するように修正してネイティブなPHP JSON 関数を有効にし、PCREバックトレース制限のために動作していなかったJSON解析クラスの問題を修正

source: This document contains the release notes for ZABBIX 1.3.8.
ja: このドキュメントはZABBIX 1.3.8のリリースノートです。

source: improved the permissions scheme in frontend
ja: フロントエンドのパーミッションスキームを改善

source: Added support of quoted numbers.
ja: 引用符付きの数字を扱えるようになりました。

source: [DEV-358] added notification macros {PROFILE.*[1..9]}
ja: [DEV-358] 通知用マクロ{PROFILE.*[1..9]}を追加

source: This document contains the release notes for Zabbix 1.8.9rc2.
ja: このドキュメントはZabbix 1.8.9rc2のリリースノートを含みます。

source: [ZBX-2239] fixed mutex (un)locking so that zabbix_server does not become forever defunct when killed
ja: [ZBX-2239] zabbix_serverをkillした際にプロセスが消滅しなくなる問題のためにミューテックスの(アン)ロック処理を修正

source: [DEV-414] created basic man pages for all Zabbix binaries
ja: [DEV-414] すべてのZabbixバイナリに基本的なmanページを作成

source: [ZBX-1382] improved performance in dahsboard latest 20 issues
ja: [ZBX-1382] ダッシュボードの「最新20件の障害」の表示速度の改善

source: [ZBX-3967] fixed alerter hang on long running alert scripts
ja: [ZBX-3967] 時間を要するアラートスクリプトの処理によってalerterがハングアップする問題を修正

source: [ZBX-2226] fixed template item update, when linked to host with existing item with same key
ja: [ZBX-2226] 同じキーを持つアイテムが存在するホストに対してテンプレートをリンクしたときのテンプレートアイテムの更新を修正

source: Support of IPv6
ja: IPv6のサポート

source: Unified host profiles
ja: ホストプロファイルの結合

source: Several new trigger functions added: dayofmonth() returns current day of month, logeventid() returns whether Event ID of the last log entry matches a regular expression.
ja: いくつかの新しいトリガー関数を追加しました: dayofmonth()は現在の月を返します、logeventid()は最後のログエントリのイベントIDが正規表現に一致するかどうかを返却します。

source: Commercial support
ja: 商用サポート

source: Advanced filtering supported by Zabbix API
ja: Zabbix APIの高度なフィルタリングのサポート

source: [ZBX-2592] added support of comma character (,) for scripts in action remote commands
ja: [ZBX-2592] アクションのリモートコマンドのスクリプトにカンマ文字(,)を利用できるように修正

source: Support of new parameter for count(period,value,operator)
ja: 新しいパラメータcount(period,value,operator)を追加

source: [ZBX-884] fixed sudden stop of Jabber notifications
ja: [ZBX-884] Jabber通知が突然停止する問題を修正

source: [DEV-276] added support of HTML text in plaintext view in screens
ja: [DEV-276] スクリーンのプレーンテキストにHTMLテキストの表示機能を追加

source: [ZBX-1591] fixed "advanced icons" for image type map elements
ja: [ZBX-1591] マップの画像タイプ「拡張アイコン」の問題を修正

source: [ZBX-623] fixed incorrect processing of function abschange() for integers
ja: [ZBX-623] 整数データの場合のabschange()関数の間違った処理を修正

source: [ZBX-1619] fixed web scenario data not removed from DB when host is deleted
ja: [ZBX-1619] ホスト削除時にWebシナリオデータがDBから削除されない問題を修正

source: [ZBX-2132] added date format constants to locales, changed zbx_date2str function to meet regional formats and date translation
ja: [ZBX-2132] 日付形式の定数をロケールに追加し、地域の形式や日付変換に合うようにzbx_date2str関数を変更

source: [ZBX-887] fixed typo in "Not accessible resources"
ja: [ZBX-887] 「Not accessible resources」の表記間違いを修正

source: [ZBX-627] fixed items update
ja: [ZBX-627] 複数アイテムの更新を修正

source: What's New in 1.6.8
ja: ZABBIX 1.6.8の変更点

source: [ZBX-2277] fixed menu position on screen
ja: [ZBX-2277] 画面上のメニューの位置を修正

source: What's New in 1.6.9
ja: ZABBIX 1.6.9の変更点

source: The triggers will define how the link is displayed.
ja: トリガーを定義する方法も表示されます。

source: What's New in 1.6.6
ja: ZABBIX 1.6.6の変更点

source: More consistent Zabbix API
ja: Zabbix APIの一貫性向上

source: What's New in 1.6.7
ja: 1.6.7の変更点

source: What's New in 1.6.4
ja: ZABBIX 1.6.4の変更点

source: What's New in 1.6.5
ja: ZABBIX 1.6.5の変更点

source: What's New in 1.6.2
ja: ZABBIX 1.6.2の変更点

source: [ZBX-3626] fixed bugs on map export: duplicate image decoding and inserting of duplicate map elements; thanks to Takanori Suzuki
ja: [ZBX-3626] マップのエクスポート時に画像のデコードやアイコンが重複する問題を修正; Takanori Suzukiに感謝

source: What's New in 1.6.3
ja: ZABBIX 1.6.3の変更点

source: fixed upgrade script to correctly process host-template linkage
ja: ホストテンプレートリンクを正しく処理するためにアップグレードスクリプトを修正

source: What's New in 1.6.1
ja: ZABBIX 1.6.1の変更点

source: [ZBX-2282] fixed availability updating of IPMI hosts, monitored by proxy
ja: [ZBX-2282] プロキシで監視をしているIPMIホスト上のエージェントの状態を更新する処理の問題を修正

source: default autologout time is set to 900
ja: デフォルトの自動ログアウト時間を900に設定

source: [ZBX-937] fixed possible server crash while processing IPMI remote command
ja: [ZBX-937] IPMIのリモートコマンド処理中にサーバーがクラッシュする問題を修正

source: when graph shows current time values, ">>" character is shown near end time
ja: グラフで現在の値を表示する際に、最終時刻付近に「>>」の文字を表示

source: We are truly grateful for your support, it really makes the difference!
ja: 我々は本当にあたながたのサポートに感謝します。これは本当に重要な影響を及ぼしています。

source: Added support of DisablePassive parameter for agent
ja: エージェントの設定にDisablePassiveパラメータを追加

source: [ZBX-2493] fixed obsolete macro used by default; start using different subject and message for default action messages
ja: [ZBX-2493] デフォルトで廃止されたマクロを利用していた問題を修正; デフォルトのアクションのメッセージのタイトルと本文を変更

source: [ZBX-3350] fixed minor interface bug and it is now not possible to add host name longer than 64 chars
ja: [ZBX-3350] 軽微なWebインターフェイスのバグの修正と64文字を超えるホスト名の利用を禁止

source: [ZBX-3074] moved the 'Status' column in the item list to the left
ja: [ZBX-3074] アイテムリストの「ステータス」カラムが左に表示されるように移動

source: Strict parsing of configuration files
ja: 設定ファイルの厳密な解析

source: Added support for {IPADDRESS}, {HOST.DNS} and {HOST.CONN} macros in trigger names.
ja: トリガー名に、{IPADDRESS}、{HOST.DNS}、{HOST.CONN}のマクロを利用することができます。
